//
//  TalkStruct.swift
//  Test
//
//  Created by 조용현 on 2023/05/02.
//

import SwiftUI

var todayDate = [d1, d2, d3, d4, d5, d6, d7, d8, d9, d10]
var d1 = "04/20"
var d2 = "04/21"
var d3 = "04/22"
var d4 = "04/23"
var d5 = "04/24"
var d6 = "04/25"
var d7 = "04/26"
var d8 = "04/27"
var d9 = "04/28"
var d10 = "04/29"
var d11 = "04/30"
var d12 = "04/31"
var d13 = "05/01"
var d14 = "05/02"
var d15 = "05/03"

var qustion = [q1, q2, q3, q4, q5, q6, q7, q8, q9, q10]
var q1 = "나의 가장 존경스러운 사람은 누군가요?"
var q2 = "우리 가족은 서로 어떤 면에서 다른가요?"
var q3 = "우리 가족은 서로 어떤 면에서 비슷한가요?"
var q4 = "가족이 가장 자랑스러운 순간은 언제인가요?"
var q5 = "가장 소중하게 여기는 우리 가족의 추억은 뭔가요?"
var q6 = "우리 가족에게 어떤 배울 점이 있다고 생각하나요?"
var q7 = "나는 어떤 취미를 갖고 있나요?"
var q8 = "내가 가장 좋아하는 음식은 뭔가요?"
var q9 = "가장 좋아하는 영화나 책이 있나요?"
var q10 = "최근에 우리 가족에게 감사했던 일이 뭔가요?"
var q11 = "가족에게 들은 말 중에 가장 인상깊은 말은 뭔가요?"
var q12 = "가족에게 미안했던 일이 있나요?"
var q13 = "우리 가족이 가장 자주하는 활동은 무엇인가요?"
var q14 = "가족 여행에서 있었던 일 중 어떤게 기억이 나나요?"
var q15 = "가족 구성원들 중에서 가장 유쾌하고 활기찬 사람은 누구인가요?"

var answerMom = [aM1...aM15]
var aM1 = "나는 문어~ 꿈을 꾸는 문어~"
var aM2 = "나는 문어~ 꿈을 꾸는 문어~"
var aM3 = "나는 문어~ 꿈을 꾸는 문어~"
var aM4 = "나는 문어~ 꿈을 꾸는 문어~"
var aM5 = "나는 문어~ 꿈을 꾸는 문어~"
var aM6 = "나는 문어~ 꿈을 꾸는 문어~"
var aM7 = "나는 문어~ 꿈을 꾸는 문어~"
var aM8 = "나는 문어~ 꿈을 꾸는 문어~"
var aM9 = "나는 문어~ 꿈을 꾸는 문어~"
var aM10 = "나는 문어~ 꿈을 꾸는 문어~"
var aM11 = "나는 문어~ 꿈을 꾸는 문어~"
var aM12 = "나는 문어~ 꿈을 꾸는 문어~"
var aM13 = "나는 문어~ 꿈을 꾸는 문어~"
var aM14 = "나는 문어~ 꿈을 꾸는 문어~"
var aM15 = "나는 문어~ 꿈을 꾸는 문어~"

var answerDad = [aD1...aD15]
var aD1 = "아빠곰~엄마곰~애기곰~"
var aD2 = "아빠곰~엄마곰~애기곰~"
var aD3 = "아빠곰~엄마곰~애기곰~"
var aD4 = "아빠곰~엄마곰~애기곰~"
var aD5 = "아빠곰~엄마곰~애기곰~"
var aD6 = "아빠곰~엄마곰~애기곰~"
var aD7 = "아빠곰~엄마곰~애기곰~"
var aD8 = "아빠곰~엄마곰~애기곰~"
var aD9 = "아빠곰~엄마곰~애기곰~"
var aD10 = "아빠곰~엄마곰~애기곰~"
var aD11 = "아빠곰~엄마곰~애기곰~"
var aD12 = "아빠곰~엄마곰~애기곰~"
var aD13 = "아빠곰~엄마곰~애기곰~"
var aD14 = "아빠곰~엄마곰~애기곰~"
var aD15 = "아빠곰~엄마곰~애기곰~"

var answerSon = [aS1...aS15]
var aS1 = "여보세요 나야~ 거기 잘 지내니~"
var aS2 = "여보세요 나야~ 거기 잘 지내니~"
var aS3 = "여보세요 나야~ 거기 잘 지내니~"
var aS4 = "여보세요 나야~ 거기 잘 지내니~"
var aS5 = "여보세요 나야~ 거기 잘 지내니~"
var aS6 = "여보세요 나야~ 거기 잘 지내니~"
var aS7 = "여보세요 나야~ 거기 잘 지내니~"
var aS8 = "여보세요 나야~ 거기 잘 지내니~"
var aS9 = "여보세요 나야~ 거기 잘 지내니~"
var aS10 = "여보세요 나야~ 거기 잘 지내니~"
var aS11 = "여보세요 나야~ 거기 잘 지내니~"
var aS12 = "여보세요 나야~ 거기 잘 지내니~"
var aS13 = "여보세요 나야~ 거기 잘 지내니~"
var aS14 = "여보세요 나야~ 거기 잘 지내니~"
var aS15 = "여보세요 나야~ 거기 잘 지내니~"

